cf/InformationRegisters/ПредставлениеКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПредставлениеКонтактнойИнформации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Грузополучатели</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/CommonModules/Почта2Сервер/Ext/Module.bsl
Функция СохранитьДокументВОблаке(Ссылка, ТабДок) Экспорт
	
	ИмяФайла = Ссылка.Метаданные().Имя + Ссылка.Номер + "_" + Формат(Ссылка.Дата,"ДФ=ddMMyy") + ".pdf";
	
	ПутьHTML 	= Константы.ПутьHTTPКОблаку.Получить(); ПутьHTML = ПутьHTML + ?(Прав(ПутьHTML, 1) = "/", "", "/");
	Путь 		= Константы.ПутьКОблаку.Получить(); Путь = Путь + ?(Прав(Путь, 1) = "\", "", "\");
		
	Попытка ТабДок.Записать(Путь + ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	Исключение
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка при записи файла на сервере " + Путь + ИмяФайла + "
											|" + стрОшибки);
		Возврат Неопределено; КонецПопытки;
	
	Возврат Новый Структура("ИмяФайла, Наименование, ТекстHTML, ПолныйПуть", 
			ИмяФайла, Строка(Ссылка), "<a href='" + ПутьHTML + ИмяФайла + "'>" + Строка(Ссылка) + "</a>", Путь + ИмяФайла);
	
КонецФункции

Функция ПолучитьНастройкиПрофиляПочты() Экспорт
	
	
	
КонецФункции

Процедура ДобавитьЗапросНаПоискПочты(ТекстЗапроса, ТекстОтбора)
	
	ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "","","
	|ОБЪЕДИНИТЬ
	|") +
	"ВЫБРАТЬ 
	|	ПЕРВЫЕ 1 ВЫРАЗИТЬ(Представление КАК СТРОКА(120)) Представление, 
	|	ЗначениеПоУмолчанию 
	|ИЗ 
	|	РегистрСведений.ПредставлениеКонтактнойИнформации ГДЕ НЕ Объект.ПометкаУдаления И " + ТекстОтбора;
	
КонецПроцедуры
Функция ПолучитьПочтуПартнера(КонтрагентСсылка) Экспорт
	
	// Сообразим запрос
	
	ТекстЗапроса = "";
	
	// Контрагент
	ДобавитьЗапросНаПоискПочты(ТекстЗапроса, "Объект = &Объект И НЕ Объект.ПометкаУдаления И Вид В ИЕРАРХИИ(&ВидыПочты)"); 
	// Контактное лицо
	ДобавитьЗапросНаПоискПочты(ТекстЗапроса, "Объект.Владелец = &Объект И НЕ Объект.ПометкаУдаления И Вид В ИЕРАРХИИ(&ВидыПочты)");
	
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО ЗначениеПоУмолчанию
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект", 	КонтрагентСсылка);
	Запрос.УстановитьПараметр("ВидыПочты", 	Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Представление, "");
	
КонецФункции

Функция ПолучитьПрофильПоУмоланию() Экспорт
	
	// Возмем или по умолчанию или первый попавшийся
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.ПрофильИнтернетПочты ГДЕ Владелец = &ТекущийПользователь УПОРЯДОЧИТЬ ПО ПоУмолчанию Убыв");
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда Возврат Выборка.Ссылка КонецЕсли;
	
КонецФункции
